AccumulationRegisters/РабочееВремяСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>РабочееВремяСотрудников</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Внутрисменное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВЦеломЗаПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВремениВытесняемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговыеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииВыполненияРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловияТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ГрафикиРаботыПоВидамВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыПоВидамВремени</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначениеНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначениеНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяВЧасах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВЦеломЗаПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииВыполненияРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловияТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РабочееВремяСотрудников/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НаборЗаписей", ЭтотОбъект.Выгрузить());
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Отбор.Регистратор.Значение);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаборЗаписей.Сотрудник,
	|	НаборЗаписей.Период,
	|	НаборЗаписей.ВидУчетаВремени,
	|	НаборЗаписей.Дней,
	|	НаборЗаписей.Часов,
	|	НаборЗаписей.План,
	|	НаборЗаписей.Внутрисменное,
	|	НаборЗаписей.ВЦеломЗаПериод,
	|	НаборЗаписей.ВидВремениВытесняемый,
	|	НаборЗаписей.ИтоговыеДанные,
	|	НаборЗаписей.ПериодРегистрации,
	|	НаборЗаписей.Территория,
	|	НаборЗаписей.УсловияТруда
	|ПОМЕСТИТЬ ВТНовыйНаборЗаписей
	|ИЗ
	|	&НаборЗаписей КАК НаборЗаписей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочееВремяСотрудников.Период,
	|	РабочееВремяСотрудников.Регистратор,
	|	РабочееВремяСотрудников.НомерСтроки,
	|	РабочееВремяСотрудников.Активность,
	|	РабочееВремяСотрудников.Сотрудник,
	|	РабочееВремяСотрудников.ВидУчетаВремени,
	|	РабочееВремяСотрудников.Дней,
	|	РабочееВремяСотрудников.Часов,
	|	РабочееВремяСотрудников.План,
	|	РабочееВремяСотрудников.Внутрисменное,
	|	РабочееВремяСотрудников.ВЦеломЗаПериод,
	|	РабочееВремяСотрудников.ВидВремениВытесняемый,
	|	РабочееВремяСотрудников.ИтоговыеДанные,
	|	РабочееВремяСотрудников.ПериодРегистрации,
	|	РабочееВремяСотрудников.Территория,
	|	РабочееВремяСотрудников.УсловияТруда
	|ПОМЕСТИТЬ ВТСтарыйНаборЗаписей
	|ИЗ
	|	РегистрНакопления.РабочееВремяСотрудников КАК РабочееВремяСотрудников
	|ГДЕ
	|	РабочееВремяСотрудников.Регистратор = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА СтарыйНаборЗаписей.Сотрудник ЕСТЬ NULL
	|			ТОГДА НовыйНаборЗаписей.Сотрудник
	|		ИНАЧЕ СтарыйНаборЗаписей.Сотрудник
	|	КОНЕЦ КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА СтарыйНаборЗаписей.Сотрудник ЕСТЬ NULL
	|			ТОГДА НАЧАЛОПЕРИОДА(НовыйНаборЗаписей.Период, МЕСЯЦ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(СтарыйНаборЗаписей.Период, МЕСЯЦ)
	|	КОНЕЦ КАК Месяц,
	|	ВЫБОР
	|		КОГДА СтарыйНаборЗаписей.Сотрудник ЕСТЬ NULL
	|			ТОГДА НовыйНаборЗаписей.ПериодРегистрации
	|		ИНАЧЕ СтарыйНаборЗаписей.ПериодРегистрации
	|	КОНЕЦ КАК ПериодРегистрации
	|ПОМЕСТИТЬ ВТПериодыСотрудников
	|ИЗ
	|	ВТНовыйНаборЗаписей КАК НовыйНаборЗаписей
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТСтарыйНаборЗаписей КАК СтарыйНаборЗаписей
	|		ПО НовыйНаборЗаписей.Сотрудник = СтарыйНаборЗаписей.Сотрудник
	|			И НовыйНаборЗаписей.Период = СтарыйНаборЗаписей.Период
	|			И НовыйНаборЗаписей.ВидУчетаВремени = СтарыйНаборЗаписей.ВидУчетаВремени
	|			И НовыйНаборЗаписей.Дней = СтарыйНаборЗаписей.Дней
	|			И НовыйНаборЗаписей.Часов = СтарыйНаборЗаписей.Часов
	|			И НовыйНаборЗаписей.План = СтарыйНаборЗаписей.План
	|			И НовыйНаборЗаписей.Внутрисменное = СтарыйНаборЗаписей.Внутрисменное
	|			И НовыйНаборЗаписей.ВЦеломЗаПериод = СтарыйНаборЗаписей.ВЦеломЗаПериод
	|			И НовыйНаборЗаписей.ВидВремениВытесняемый = СтарыйНаборЗаписей.ВидВремениВытесняемый
	|			И НовыйНаборЗаписей.ИтоговыеДанные = СтарыйНаборЗаписей.ИтоговыеДанные
	|			И НовыйНаборЗаписей.ПериодРегистрации = СтарыйНаборЗаписей.ПериодРегистрации
	|			И НовыйНаборЗаписей.Территория = СтарыйНаборЗаписей.Территория
	|			И НовыйНаборЗаписей.УсловияТруда = СтарыйНаборЗаписей.УсловияТруда
	|ГДЕ
	|	(НовыйНаборЗаписей.Сотрудник ЕСТЬ NULL
	|			ИЛИ СтарыйНаборЗаписей.Сотрудник ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПериодыСотрудников.Сотрудник,
	|	ПериодыСотрудников.Месяц,
	|	ГрафикиРаботыПоВидамВремени.ПериодРегистрации
	|ИЗ
	|	ВТПериодыСотрудников КАК ПериодыСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|		ПО ПериодыСотрудников.Сотрудник = ГрафикиРаботыПоВидамВремени.ГрафикРаботы
	|			И ПериодыСотрудников.Месяц = ГрафикиРаботыПоВидамВремени.Месяц
	|			И ПериодыСотрудников.ПериодРегистрации <= ГрафикиРаботыПоВидамВремени.ПериодРегистрации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыСведений.ГрафикиРаботыПоВидамВремени.СоздатьНаборЗаписей();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей.Отбор.ГрафикРаботы.Установить(Выборка.Сотрудник);
		НаборЗаписей.Отбор.Месяц.Установить(Выборка.Месяц);	
		НаборЗаписей.Отбор.ПериодРегистрации.Установить(Выборка.ПериодРегистрации);
		НаборЗаписей.Записать();
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
